    #// Методы для Fixnum

number = 1990.next  #// Метод увеличивает число на единицу
puts "#{number}"

number = 1990.zero? #// Метод проверяет, является ли число нулем
puts "#{number}"

number = -1990.abs #// Метод возвращает модуль числа
puts "#{number}"


    #// Методы класса Float

float = 1.2324.floor  #// Метод окгругляется вещественное число вниз до целой части
puts "#{float}"

float = 40.0.divmod #// Метод возвращающий результат деления 2-х чисел в виде массиво с целой частью и остатком от деления
puts "#{float}"
